OpenNuvoton/M480BSP/Library/USB_Host/src_core/usb.c
/*
 * drivers/usb/core/usb.c
 *
 * (C) Copyright Linus Torvalds 1999
 * (C) Copyright Johannes Erdfelt 1999-2001
 * (C) Copyright Andreas Gal 1999
 * (C) Copyright Gregory P. Smith 1999
 * (C) Copyright Deti Fliegl 1999 (new USB architecture)
 * (C) Copyright Randy Dunlap 2000
 * (C) Copyright David Brownell 2000-2004
 * (C) Copyright Yggdrasil Computing, Inc. 2000
 *     (usb_device_id matching changes by Adam J. Richter)
 * (C) Copyright Greg Kroah-Hartman 2002-2003
 *
 * NOTE! This is not actually a driver at all, rather this is
 * just a collection of helper routines that implement the
 * generic USB things that the real drivers can use..
 *
 * Think of this as a "USB library" rather than anything else.
 * It should be considered a slave, with no callbacks. Callbacks
 * are evil.
 */

/**************************************************************************//**
 * @file     usb.c
 * @version  V1.10
 * $Revision: 11 $
 * $Date: 14/10/03 1:54p $
 * @brief  Ported from Linux USB host driver.
 *
 * @note
 * Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "M480.h"

#include "usb.h"
#include "hcd.h"

/// @cond HIDDEN_SYMBOLS

const char *usbcore_name = "usbcore";

static int nousb;   /* Disable USB when built into kernel image */

#ifdef  CONFIG_USB_SUSPEND
static int usb_autosuspend_delay = 2;       /* Default delay value,
                         * in seconds */
module_param_named(autosuspend, usb_autosuspend_delay, int, 0644);
MODULE_PARM_DESC(autosuspend, "default autosuspend delay");

#else
#define usb_autosuspend_delay       0
#endif


/**
 * usb_find_alt_setting() - Given a configuration, find the alternate setting
 * for the given interface.
 * @config: the configuration to search (not necessarily the current config).
 * @iface_num: interface number to search in
 * @alt_num: alternate interface setting number to search for.
 *
 * Search the configuration's interface cache for the given alt setting.
 */
struct usb_host_interface *usb_find_alt_setting(
    struct usb_host_config *config,
    unsigned int iface_num,
    unsigned int alt_num)
{
    struct usb_interface_cache *intf_cache = NULL;
    int i;

    for (i = 0; i < config->desc.bNumInterfaces; i++) {
        if (config->intf_cache[i]->altsetting[0].desc.bInterfaceNumber
                == iface_num) {
            intf_cache = config->intf_cache[i];
            break;
        }
    }
    if (!intf_cache)
        return NULL;
    for (i = 0; i < intf_cache->num_altsetting; i++)
        if (intf_cache->altsetting[i].desc.bAlternateSetting == alt_num)
            return &intf_cache->altsetting[i];

    USB_debug("Did not find alt setting %x for intf %x, config %x\n", alt_num, iface_num,
              config->desc.bConfigurationValue);
    return NULL;
}

/**
 * usb_ifnum_to_if - get the interface object with a given interface number
 * @dev: the device whose current configuration is considered
 * @ifnum: the desired interface
 *
 * This walks the device descriptor for the currently active configuration
 * and returns a pointer to the interface with that particular interface
 * number, or null.
 *
 * Note that configuration descriptors are not required to assign interface
 * numbers sequentially, so that it would be incorrect to assume that
 * the first interface in that descriptor corresponds to interface zero.
 * This routine helps device drivers avoid such mistakes.
 * However, you should make sure that you do the right thing with any
 * alternate settings available for this interfaces.
 *
 * Don't call this function unless you are bound to one of the interfaces
 * on this device or you have locked the device!
 */
struct usb_interface *usb_ifnum_to_if(const struct usb_device *dev,
                                      unsigned ifnum)
{
    struct usb_host_config *config;
    int i;

    config = dev->actconfig;

    if (!config)
        return NULL;
    for (i = 0; i < config->desc.bNumInterfaces; i++)
        if (config->interface[i]->altsetting[0]
                .desc.bInterfaceNumber == ifnum)
            return config->interface[i];

    return NULL;
}

/**
 * usb_altnum_to_altsetting - get the altsetting structure with a given alternate setting number.
 * @intf: the interface containing the altsetting in question
 * @altnum: the desired alternate setting number
 *
 * This searches the altsetting array of the specified interface for
 * an entry with the correct bAlternateSetting value and returns a pointer
 * to that entry, or null.
 *
 * Note that altsettings need not be stored sequentially by number, so
 * it would be incorrect to assume that the first altsetting entry in
 * the array corresponds to altsetting zero.  This routine helps device
 * drivers avoid such mistakes.
 *
 * Don't call this function unless you are bound to the intf interface
 * or you have locked the device!
 */
struct usb_host_interface *usb_altnum_to_altsetting(
    const struct usb_interface *intf,
    unsigned int altnum)
{
    int i;

    for (i = 0; i < intf->num_altsetting; i++) {
        if (intf->altsetting[i].desc.bAlternateSetting == altnum)
            return &intf->altsetting[i];
    }
    return NULL;
}

struct find_interface_arg {
    int minor;
    struct device_driver *drv;
};


#if 0
static int __find_interface(struct device *dev, void *data)
{
    struct find_interface_arg *arg;
    struct usb_interface *intf;

    arg = data;

    if (!is_usb_interface(dev))
        return 0;

    if (dev->driver != arg->drv)
        return 0;
    intf = to_usb_interface_by_dev(dev);  // to_usb_interface(dev);
    return intf->minor == arg->minor;
}
#endif


/**
 * usb_find_interface - find usb_interface pointer for driver and device
 * @drv: the driver whose current configuration is considered
 * @minor: the minor number of the desired device
 *
 * This walks the bus device list and returns a pointer to the interface
 * with the matching minor and driver.  Note, this only works for devices
 * that share the USB major number.
 */
#if 0
struct usb_interface *usb_find_interface(struct usb_driver *drv, int minor)
{
    struct find_interface_arg argb;
    struct device *dev;

    argb.minor = minor;
    argb.drv = &drv->drvwrap.driver;

    dev = bus_find_device(&usb_bus_type, NULL, &argb, __find_interface);

    /* Drop reference count from bus_find_device */
    put_device(dev);

    return dev ? to_usb_interface_by_dev(dev) : NULL;
    //return dev ? to_usb_interface(dev) : NULL;
}
#endif


/**
 * usb_release_dev - free a usb device structure when all users of it are finished.
 * @dev: device that's been disconnected
 *
 * Will be called only by the device core when all users of this usb device are
 * done.
 */
#if 0
static void usb_release_dev(struct device *dev)
{
    struct usb_device *udev;
    struct usb_hcd *hcd;

