OpenNuvoton/M480BSP/Library/USB_Host/src_core/usb.c
    udev = to_usb_device_by_dev(dev);
    hcd = bus_to_hcd(udev->bus);

    usb_destroy_configuration(udev);
    usb_release_bos_descriptor(udev);
    usb_put_hcd(hcd);
    kfree(udev->product);
    kfree(udev->manufacturer);
    kfree(udev->serial);
    kfree(udev);
}
#endif


#ifdef  CONFIG_HOTPLUG
static int usb_dev_uevent(struct device *dev, struct kobj_uevent_env *env)
{
    struct usb_device *usb_dev;

    usb_dev = to_usb_device_by_dev(dev);

    if (add_uevent_var(env, "BUSNUM=%03d", usb_dev->bus->busnum))
        return -ENOMEM;

    if (add_uevent_var(env, "DEVNUM=%03d", usb_dev->devnum))
        return -ENOMEM;

    return 0;
}

#else

//static int usb_dev_uevent(struct device *dev, struct kobj_uevent_env *env)
//{
//  return -ENODEV;
//}
#endif  /* CONFIG_HOTPLUG */

#ifdef  CONFIG_PM

/* USB device Power-Management thunks.
 * There's no need to distinguish here between quiescing a USB device
 * and powering it down; the generic_suspend() routine takes care of
 * it by skipping the usb_port_suspend() call for a quiesce.  And for
 * USB interfaces there's no difference at all.
 */

static int usb_dev_prepare(struct device *dev)
{
    return 0;       /* Implement eventually? */
}

static void usb_dev_complete(struct device *dev)
{
    /* Currently used only for rebinding interfaces */
    usb_resume(dev, PMSG_ON);   /* FIXME: change to PMSG_COMPLETE */
}

static int usb_dev_suspend(struct device *dev)
{
    return usb_suspend(dev, PMSG_SUSPEND);
}

static int usb_dev_resume(struct device *dev)
{
    return usb_resume(dev, PMSG_RESUME);
}

static int usb_dev_freeze(struct device *dev)
{
    return usb_suspend(dev, PMSG_FREEZE);
}

static int usb_dev_thaw(struct device *dev)
{
    return usb_resume(dev, PMSG_THAW);
}

static int usb_dev_poweroff(struct device *dev)
{
    return usb_suspend(dev, PMSG_HIBERNATE);
}

static int usb_dev_restore(struct device *dev)
{
    return usb_resume(dev, PMSG_RESTORE);
}


static const struct dev_pm_ops usb_device_pm_ops = {
    .prepare =  usb_dev_prepare,
    .complete = usb_dev_complete,
    .suspend =  usb_dev_suspend,
    .resume =   usb_dev_resume,
    .freeze =   usb_dev_freeze,
    .thaw =     usb_dev_thaw,
    .poweroff = usb_dev_poweroff,
    .restore =  usb_dev_restore,
#ifdef CONFIG_USB_SUSPEND
    .runtime_suspend =  usb_runtime_suspend,
    .runtime_resume =   usb_runtime_resume,
    .runtime_idle =     usb_runtime_idle,
#endif
};

#endif  /* CONFIG_PM */

#if 0
static char *usb_devnode(struct device *dev, mode_t *mode)
{
    struct usb_device *usb_dev;

    usb_dev = to_usb_device_by_dev(dev);
    return kasprintf(GFP_KERNEL, "bus/usb/%03d/%03d",
                     usb_dev->bus->busnum, usb_dev->devnum);
}
#endif

#if 0
struct device_type usb_device_type = {
    .name =     "usb_device",
    .release =  usb_release_dev,
    .uevent =   usb_dev_uevent,
    .devnode =  usb_devnode,
#ifdef CONFIG_PM
    .pm =       &usb_device_pm_ops,
#endif
};
#else
struct device_type usb_device_type = { "usb_device" };
#endif


#if 0
/* Returns 1 if @usb_bus is WUSB, 0 otherwise */
static unsigned usb_bus_is_wusb(struct usb_bus *bus)
{
    struct usb_hcd *hcd = (struct usb_hcd *)bus;  // container_of(bus, struct usb_hcd, self);
    return hcd->wireless;
}
#endif


/**
 * usb_alloc_dev - usb device constructor (usbcore-internal)
 * @parent: hub to which device is connected; null to allocate a root hub
 * @bus: bus used to access the device
 * @port1: one-based index of port; ignored for root hubs
 * Context: !in_interrupt()
 *
 * Only hub drivers (including virtual root hub drivers for host
 * controllers) should ever call this.
 *
 * This call may not be used in a non-sleeping context.
 */
struct usb_device *usb_alloc_dev(struct usb_device *parent,
                                 struct usb_bus *bus, unsigned port1)
{
    struct usb_device *dev;
    struct usb_hcd *usb_hcd;
    //unsigned root_hub = 0;

    usb_hcd = (struct usb_hcd *)bus;    // container_of(bus, struct usb_hcd, self);

    dev = kzalloc(sizeof(*dev), GFP_KERNEL);
    if (!dev)
        return NULL;

    if (!usb_get_hcd(bus_to_hcd(bus))) {
        kfree(dev);
        return NULL;
    }
    /* Root hubs aren't true devices, so don't allocate HCD resources */
    if (usb_hcd->driver->alloc_dev && parent &&
            !usb_hcd->driver->alloc_dev(usb_hcd, dev)) {
        usb_put_hcd(bus_to_hcd(bus));
        kfree(dev);
        return NULL;
    }

    dev->dev.bus = &usb_bus_type;
    dev->dev.type = &usb_device_type;
    //dev->dev.groups = usb_device_groups;
    //dev->dev.dma_mask = bus->controller->dma_mask;
    //set_dev_node(&dev->dev, dev_to_node(bus->controller));
    dev->state = USB_STATE_ATTACHED;
    atomic_set(&dev->urbnum, 0);

    INIT_LIST_HEAD(&dev->ep0.urb_list);
    dev->ep0.desc.bLength = USB_DT_ENDPOINT_SIZE;
    dev->ep0.desc.bDescriptorType = USB_DT_ENDPOINT;
    /* ep0 maxpacket comes later, from device descriptor */
    usb_enable_endpoint(dev, &dev->ep0, false);
    dev->can_submit = 1;

    /* Save readable and stable topology id, distinguishing devices
     * by location for diagnostics, tools, driver model, etc.  The
     * string is a path along hub ports, from the root.  Each device's
     * dev->devpath will be stable until USB is re-cabled, and hubs
     * are often labeled with these port numbers.  The name isn't
     * as stable:  bus->busnum changes easily from modprobe order,
     * cardbus or pci hotplugging, and so on.
     */
    if (unlikely(!parent)) {
        dev->devpath[0] = '0';
        dev->route = 0;

        dev->dev.parent = bus->controller;
        //dev_set_name(&dev->dev, "usb%d", bus->busnum);
        //root_hub = 1;
    } else {
        /* match any labeling on the hubs; it's one-based */
        if (parent->devpath[0] == '0') {
            snprintf(dev->devpath, sizeof dev->devpath,
                     "%d", port1);
            /* Root ports are not counted in route string */
            dev->route = 0;
        } else {
            snprintf(dev->devpath, sizeof dev->devpath,
                     "%s.%d", parent->devpath, port1);
            /* Route string assumes hubs have less than 16 ports */
            if (port1 < 15)
                dev->route = parent->route +
                             (port1 << ((parent->level - 1)*4));
            else
                dev->route = parent->route +
                             (15 << ((parent->level - 1)*4));
        }

        dev->dev.parent = &parent->dev;
        //dev_set_name(&dev->dev, "%d-%s", bus->busnum, dev->devpath);

