OpenNuvoton/M480BSP/Library/USB_Host/src_core/usb.c
        /* hub driver sets up TT records */
    }

    dev->portnum = port1;
    dev->bus = bus;
    dev->parent = parent;
    INIT_LIST_HEAD(&dev->filelist);

#ifdef  CONFIG_PM
    pm_runtime_set_autosuspend_delay(&dev->dev,
                                     usb_autosuspend_delay * 1000);
    dev->connect_time = jiffies;
    dev->active_duration = -jiffies;
#endif

#ifdef NUVOTON_PORTED
    dev->authorized = 1;
#else
    if (root_hub)   /* Root hub always ok [and always wired] */
        dev->authorized = 1;
    else {
        dev->authorized = usb_hcd->authorized_default;
        //dev->wusb = usb_bus_is_wusb(bus)? 1 : 0;
    }
#endif
    return dev;
}

/**
 * usb_get_dev - increments the reference count of the usb device structure
 * @dev: the device being referenced
 *
 * Each live reference to a device should be refcounted.
 *
 * Drivers for USB interfaces should normally record such references in
 * their probe() methods, when they bind to an interface, and release
 * them by calling usb_put_dev(), in their disconnect() methods.
 *
 * A pointer to the device with the incremented reference counter is returned.
 */
struct usb_device *usb_get_dev(struct usb_device *dev)
{
    return dev;
}

/**
 * usb_put_dev - release a use of the usb device structure
 * @dev: device that's been disconnected
 *
 * Must be called when a user of a device is finished with it.  When the last
 * user of the device calls this function, the memory of the device is freed.
 */
void usb_put_dev(struct usb_device *dev)
{
    //if (dev)
    //  put_device(&dev->dev);
}

/**
 * usb_get_intf - increments the reference count of the usb interface structure
 * @intf: the interface being referenced
 *
 * Each live reference to a interface must be refcounted.
 *
 * Drivers for USB interfaces should normally record such references in
 * their probe() methods, when they bind to an interface, and release
 * them by calling usb_put_intf(), in their disconnect() methods.
 *
 * A pointer to the interface with the incremented reference counter is
 * returned.
 */
struct usb_interface *usb_get_intf(struct usb_interface *intf)
{
    return intf;
}

/**
 * usb_put_intf - release a use of the usb interface structure
 * @intf: interface that's been decremented
 *
 * Must be called when a user of an interface is finished with it.  When the
 * last user of the interface calls this function, the memory of the interface
 * is freed.
 */
void usb_put_intf(struct usb_interface *intf)
{
    //if (intf)
    //  put_device(&intf->dev);
}

/*          USB device locking
 *
 * USB devices and interfaces are locked using the semaphore in their
 * embedded struct device.  The hub driver guarantees that whenever a
 * device is connected or disconnected, drivers are called with the
 * USB device locked as well as their particular interface.
 *
 * Complications arise when several devices are to be locked at the same
 * time.  Only hub-aware drivers that are part of usbcore ever have to
 * do this; nobody else needs to worry about it.  The rule for locking
 * is simple:
 *
 *  When locking both a device and its parent, always lock the
 *  the parent first.
 */

/**
 * usb_lock_device_for_reset - cautiously acquire the lock for a usb device structure
 * @udev: device that's being locked
 * @iface: interface bound to the driver making the request (optional)
 *
 * Attempts to acquire the device lock, but fails if the device is
 * NOTATTACHED or SUSPENDED, or if iface is specified and the interface
 * is neither BINDING nor BOUND.  Rather than sleeping to wait for the
 * lock, the routine polls repeatedly.  This is to prevent deadlock with
 * disconnect; in some drivers (such as usb-storage) the disconnect()
 * or suspend() method will block waiting for a device reset to complete.
 *
 * Returns a negative error code for failure, otherwise 0.
 */
#if 0
int usb_lock_device_for_reset(struct usb_device *udev,
                              const struct usb_interface *iface)
{
    unsigned long jiffies_expire = jiffies + HZ;

    if (udev->state == USB_STATE_NOTATTACHED)
        return -ENODEV;
    if (udev->state == USB_STATE_SUSPENDED)
        return -EHOSTUNREACH;
    if (iface && (iface->condition == USB_INTERFACE_UNBINDING ||
                  iface->condition == USB_INTERFACE_UNBOUND))
        return -EINTR;

    while (!usb_trylock_device(udev)) {

        /* If we can't acquire the lock after waiting one second,
         * we're probably deadlocked */
        if (time_after(jiffies, jiffies_expire))
            return -EBUSY;

        msleep(15);
        if (udev->state == USB_STATE_NOTATTACHED)
            return -ENODEV;
        if (udev->state == USB_STATE_SUSPENDED)
            return -EHOSTUNREACH;
        if (iface && (iface->condition == USB_INTERFACE_UNBINDING ||
                      iface->condition == USB_INTERFACE_UNBOUND))
            return -EINTR;
    }
    return 0;
}
#endif

/**
 * usb_get_current_frame_number - return current bus frame number
 * @dev: the device whose bus is being queried
 *
 * Returns the current frame number for the USB host controller
 * used with the given USB device.  This can be used when scheduling
 * isochronous requests.
 *
 * Note that different kinds of host controller have different
 * "scheduling horizons".  While one type might support scheduling only
 * 32 frames into the future, others could support scheduling up to
 * 1024 frames into the future.
 */
int usb_get_current_frame_number(struct usb_device *dev)
{
    return usb_hcd_get_frame_number(dev);
}

/*-------------------------------------------------------------------*/
/*
 * __usb_get_extra_descriptor() finds a descriptor of specific type in the
 * extra field of the interface and endpoint descriptor structs.
 */

int __usb_get_extra_descriptor(char *buffer, unsigned size,
                               unsigned char type, void **ptr)
{
    struct usb_descriptor_header *header;

    while (size >= sizeof(struct usb_descriptor_header)) {
        header = (struct usb_descriptor_header *)buffer;

        if (header->bLength < 2) {
            USB_error("%s: bogus descriptor, type %d length %d\n",
                      usbcore_name,
                      header->bDescriptorType,
                      header->bLength);
            return -1;
        }

        if (header->bDescriptorType == type) {
            *ptr = header;
            return 0;
        }

