OpenNuvoton/M480BSP/Library/USB_Host/src_core/usb.c
        buffer += header->bLength;
        size -= header->bLength;
    }
    return -1;
}


/**
 * usb_alloc_coherent - allocate dma-consistent buffer for URB_NO_xxx_DMA_MAP
 * @dev: device the buffer will be used with
 * @size: requested buffer size
 * @mem_flags: affect whether allocation may block
 * @dma: used to return DMA address of buffer
 *
 * Return value is either null (indicating no buffer could be allocated), or
 * the cpu-space pointer to a buffer that may be used to perform DMA to the
 * specified device.  Such cpu-space buffers are returned along with the DMA
 * address (through the pointer provided).
 *
 * These buffers are used with URB_NO_xxx_DMA_MAP set in urb->transfer_flags
 * to avoid behaviors like using "DMA bounce buffers", or thrashing IOMMU
 * hardware during URB completion/resubmit.  The implementation varies between
 * platforms, depending on details of how DMA will work to this device.
 * Using these buffers also eliminates cacheline sharing problems on
 * architectures where CPU caches are not DMA-coherent.  On systems without
 * bus-snooping caches, these buffers are uncached.
 *
 * When the buffer is no longer used, free it with usb_free_coherent().
 */
#if 0
void *usb_alloc_coherent(struct usb_device *dev, size_t size, gfp_t mem_flags,
                         dma_addr_t *dma)
{
    if (!dev || !dev->bus)
        return NULL;
    return hcd_buffer_alloc(dev->bus, size, mem_flags, dma);
}
#endif

/**
 * usb_free_coherent - free memory allocated with usb_alloc_coherent()
 * @dev: device the buffer was used with
 * @size: requested buffer size
 * @addr: CPU address of buffer
 * @dma: DMA address of buffer
 *
 * This reclaims an I/O buffer, letting it be reused.  The memory must have
 * been allocated using usb_alloc_coherent(), and the parameters must match
 * those provided in that allocation request.
 */
#if 0
void usb_free_coherent(struct usb_device *dev, size_t size, void *addr,
                       dma_addr_t dma)
{
    if (!dev || !dev->bus)
        return;
    if (!addr)
        return;
    hcd_buffer_free(dev->bus, size, addr, dma);
}
#endif

/**
 * usb_buffer_map - create DMA mapping(s) for an urb
 * @urb: urb whose transfer_buffer/setup_packet will be mapped
 *
 * Return value is either null (indicating no buffer could be mapped), or
 * the parameter.  URB_NO_TRANSFER_DMA_MAP is
 * added to urb->transfer_flags if the operation succeeds.  If the device
 * is connected to this system through a non-DMA controller, this operation
 * always succeeds.
 *
 * This call would normally be used for an urb which is reused, perhaps
 * as the target of a large periodic transfer, with usb_buffer_dmasync()
 * calls to synchronize memory and dma state.
 *
 * Reverse the effect of this call with usb_buffer_unmap().
 */
#if 0
struct urb *usb_buffer_map(struct urb *urb)
{
    struct usb_bus      *bus;
    struct device       *controller;

    if (!urb
            || !urb->dev
            || !(bus = urb->dev->bus)
            || !(controller = bus->controller))
        return NULL;

    if (controller->dma_mask) {
        urb->transfer_dma = dma_map_single(controller,
                                           urb->transfer_buffer, urb->transfer_buffer_length,
                                           usb_pipein(urb->pipe)
                                           ? DMA_FROM_DEVICE : DMA_TO_DEVICE);
        /* FIXME generic api broken like pci, can't report errors */
        /* if (urb->transfer_dma == DMA_ADDR_INVALID) return 0; */
    } else
        urb->transfer_dma = ~0;
    urb->transfer_flags |= URB_NO_TRANSFER_DMA_MAP;
    return urb;
}
#endif  /*  0  */

/* XXX DISABLED, no users currently.  If you wish to re-enable this
 * XXX please determine whether the sync is to transfer ownership of
 * XXX the buffer from device to cpu or vice verse, and thusly use the
 * XXX appropriate _for_{cpu,device}() method.  -DaveM
 */
#if 0

/**
 * usb_buffer_dmasync - synchronize DMA and CPU view of buffer(s)
 * @urb: urb whose transfer_buffer/setup_packet will be synchronized
 */
void usb_buffer_dmasync(struct urb *urb)
{
    struct usb_bus      *bus;
    struct device       *controller;

    if (!urb
            || !(urb->transfer_flags & URB_NO_TRANSFER_DMA_MAP)
            || !urb->dev
            || !(bus = urb->dev->bus)
            || !(controller = bus->controller))
        return;

    if (controller->dma_mask) {
        dma_sync_single_for_cpu(controller,
                                urb->transfer_dma, urb->transfer_buffer_length,
                                usb_pipein(urb->pipe)
                                ? DMA_FROM_DEVICE : DMA_TO_DEVICE);
        if (usb_pipecontrol(urb->pipe))
            dma_sync_single_for_cpu(controller,
                                    urb->setup_dma,
                                    sizeof(struct usb_ctrlrequest),
                                    DMA_TO_DEVICE);
    }
}
#endif

/**
 * usb_buffer_unmap - free DMA mapping(s) for an urb
 * @urb: urb whose transfer_buffer will be unmapped
 *
 * Reverses the effect of usb_buffer_map().
 */
#if 0
void usb_buffer_unmap(struct urb *urb)
{
    struct usb_bus      *bus;
    struct device       *controller;

    if (!urb
            || !(urb->transfer_flags & URB_NO_TRANSFER_DMA_MAP)
            || !urb->dev
            || !(bus = urb->dev->bus)
            || !(controller = bus->controller))
        return;

    if (controller->dma_mask) {
        dma_unmap_single(controller,
                         urb->transfer_dma, urb->transfer_buffer_length,
                         usb_pipein(urb->pipe)
                         ? DMA_FROM_DEVICE : DMA_TO_DEVICE);
    }
    urb->transfer_flags &= ~URB_NO_TRANSFER_DMA_MAP;
}
#endif  /*  0  */

#if 0
/**
 * usb_buffer_map_sg - create scatterlist DMA mapping(s) for an endpoint
 * @dev: device to which the scatterlist will be mapped
 * @is_in: mapping transfer direction
 * @sg: the scatterlist to map
 * @nents: the number of entries in the scatterlist
 *
 * Return value is either < 0 (indicating no buffers could be mapped), or
 * the number of DMA mapping array entries in the scatterlist.
 *
 * The caller is responsible for placing the resulting DMA addresses from
 * the scatterlist into URB transfer buffer pointers, and for setting the
 * URB_NO_TRANSFER_DMA_MAP transfer flag in each of those URBs.
 *
 * Top I/O rates come from queuing URBs, instead of waiting for each one
 * to complete before starting the next I/O.   This is particularly easy
 * to do with scatterlists.  Just allocate and submit one URB for each DMA
 * mapping entry returned, stopping on the first error or when all succeed.
 * Better yet, use the usb_sg_*() calls, which do that (and more) for you.
 *
 * This call would normally be used when translating scatterlist requests,
 * rather than usb_buffer_map(), since on some hardware (with IOMMUs) it
 * may be able to coalesce mappings for improved I/O efficiency.
 *
 * Reverse the effect of this call with usb_buffer_unmap_sg().
 */
int usb_buffer_map_sg(const struct usb_device *dev, int is_in,
                      struct scatterlist *sg, int nents)
{
    struct usb_bus      *bus;
    struct device       *controller;

    if (!dev
            || !(bus = dev->bus)
            || !(controller = bus->controller)
            || !controller->dma_mask)
        return -EINVAL;

    /* FIXME generic api broken like pci, can't report errors */
    return dma_map_sg(controller, sg, nents,
                      is_in ? DMA_FROM_DEVICE : DMA_TO_DEVICE) ? : -ENOMEM;
}
#endif

/* XXX DISABLED, no users currently.  If you wish to re-enable this
 * XXX please determine whether the sync is to transfer ownership of
 * XXX the buffer from device to cpu or vice verse, and thusly use the
 * XXX appropriate _for_{cpu,device}() method.  -DaveM
 */
#if 0

/**
 * usb_buffer_dmasync_sg - synchronize DMA and CPU view of scatterlist buffer(s)
 * @dev: device to which the scatterlist will be mapped
 * @is_in: mapping transfer direction
 * @sg: the scatterlist to synchronize
 * @n_hw_ents: the positive return value from usb_buffer_map_sg
 *
 * Use this when you are re-using a scatterlist's data buffers for
 * another USB request.
 */
void usb_buffer_dmasync_sg(const struct usb_device *dev, int is_in,
                           struct scatterlist *sg, int n_hw_ents)
{
    struct usb_bus      *bus;
    struct device       *controller;

    if (!dev
            || !(bus = dev->bus)
            || !(controller = bus->controller)
            || !controller->dma_mask)
        return;

    dma_sync_sg_for_cpu(controller, sg, n_hw_ents,
                        is_in ? DMA_FROM_DEVICE : DMA_TO_DEVICE);
}
#endif

