OpenNuvoton/M480BSP/Library/USB_Host/src_core/usb.c
#if 0
/**
 * usb_buffer_unmap_sg - free DMA mapping(s) for a scatterlist
 * @dev: device to which the scatterlist will be mapped
 * @is_in: mapping transfer direction
 * @sg: the scatterlist to unmap
 * @n_hw_ents: the positive return value from usb_buffer_map_sg
 *
 * Reverses the effect of usb_buffer_map_sg().
 */
void usb_buffer_unmap_sg(const struct usb_device *dev, int is_in,
                         struct scatterlist *sg, int n_hw_ents)
{
    struct usb_bus      *bus;
    struct device       *controller;

    if (!dev
            || !(bus = dev->bus)
            || !(controller = bus->controller)
            || !controller->dma_mask)
        return;

    dma_unmap_sg(controller, sg, n_hw_ents,
                 is_in ? DMA_FROM_DEVICE : DMA_TO_DEVICE);
}
#endif

/* To disable USB, kernel command line is 'nousb' not 'usbcore.nousb' */
#ifdef MODULE
module_param(nousb, bool, 0444);
#else
//core_param(nousb, nousb, bool, 0444);
#endif

/*
 * for external read access to <nousb>
 */
int usb_disabled(void)
{
    return nousb;
}

/*
 * Notifications of device and interface registration
 */
#if 0
static int usb_bus_notify(struct notifier_block *nb, unsigned long action,
                          void *data)
{
    struct device *dev = data;

    switch (action) {
    case BUS_NOTIFY_ADD_DEVICE:
        if (dev->type == &usb_device_type)
            (void) usb_create_sysfs_dev_files(to_usb_device_by_dev(dev));
        else if (dev->type == &usb_if_device_type)
            usb_create_sysfs_intf_files(to_usb_interface_by_dev(dev));
        break;

    case BUS_NOTIFY_DEL_DEVICE:
        //if (dev->type == &usb_device_type)
        //  usb_remove_sysfs_dev_files(to_usb_device_by_dev(dev));
        //else if (dev->type == &usb_if_device_type)
        //  usb_remove_sysfs_intf_files(to_usb_interface_by_dev(dev));
        break;
    }
    return 0;
}

static struct notifier_block usb_bus_nb = {
    .notifier_call = usb_bus_notify,
};
#endif

#if 0
struct dentry *usb_debug_root;

static struct dentry *usb_debug_devices;

static int usb_debugfs_init(void)
{
    usb_debug_root = debugfs_create_dir("usb", NULL);
    if (!usb_debug_root)
        return -ENOENT;

    usb_debug_devices = debugfs_create_file("devices", 0444,
                                            usb_debug_root, NULL,
                                            &usbfs_devices_fops);
    if (!usb_debug_devices) {
        debugfs_remove(usb_debug_root);
        usb_debug_root = NULL;
        return -ENOENT;
    }

    return 0;
}

static void usb_debugfs_cleanup(void)
{
    debugfs_remove(usb_debug_devices);
    debugfs_remove(usb_debug_root);
}
#endif


#if 0
/*
 * Init
 */
static int __init usb_init(void)
{
    int retval;
    //if (nousb) {
    //  pr_info("%s: USB support disabled\n", usbcore_name);
    //  return 0;
    //}

    //retval = usb_debugfs_init();
    //if (retval)
    //  goto out;

    retval = bus_register(&usb_bus_type);
    if (retval)
        goto bus_register_failed;
    //retval = bus_register_notifier(&usb_bus_type, &usb_bus_nb);
    //if (retval)
    //  goto bus_notifier_failed;
    //retval = usb_major_init();
    //if (retval)
    //  goto major_init_failed;
    //retval = usb_register(&usbfs_driver);
    //if (retval)
    //  goto driver_register_failed;
    //retval = usb_devio_init();
    //if (retval)
    //  goto usb_devio_init_failed;
    //retval = usbfs_init();
    //if (retval)
    //  goto fs_init_failed;
    retval = usb_hub_init();
    if (retval)
        goto hub_init_failed;
    //retval = usb_register_device_driver(&usb_generic_driver, THIS_MODULE);
    //if (!retval)
    //  goto out;

    usb_hub_cleanup();
hub_init_failed:
    //usbfs_cleanup();
//fs_init_failed:
    //usb_devio_cleanup();
//usb_devio_init_failed:
    //usb_deregister(&usbfs_driver);
//driver_register_failed:
    //usb_major_cleanup();
//major_init_failed:
    //bus_unregister_notifier(&usb_bus_type, &usb_bus_nb);
//bus_notifier_failed:
    //bus_unregister(&usb_bus_type);
bus_register_failed:
    //usb_debugfs_cleanup();
//out:
    return retval;
}

/*
 * Cleanup
 */
//static void __exit usb_exit(void)
//{
/* This will matter if shutdown/reboot does exitcalls. */
//if (nousb)
//  return;

//usb_deregister_device_driver(&usb_generic_driver);
//usb_major_cleanup();
//usbfs_cleanup();
//usb_deregister(&usbfs_driver);
//usb_devio_cleanup();
//usb_hub_cleanup();
//bus_unregister_notifier(&usb_bus_type, &usb_bus_nb);
//bus_unregister(&usb_bus_type);
//usb_debugfs_cleanup();
//}

//subsys_initcall(usb_init);
//module_exit(usb_exit);
#endif

/// @endcond HIDDEN_SYMBOLS
